
	 [
		{
			"id": 1,
			"category": "Christmas",
			"text": "Why don’t crabs celebrate Christmas? Because they’re shellfish."
		},
		{
			"id": 2,
			"category": "Christmas",
			"text": "What’s every parent’s favorite Christmas carol? Silent Night."
		},
		{
			"id": 3,
			"category": "Christmas",
			"text": "What do snowmen eat for breakfast? Frosted Flakes."
		},
		{
			"id": 4,
			"category": "Christmas",
			"text": "Why did Santa go to music school? To improve his wrapping skills."
		},
		{
			"id": 5,
			"category": "Christmas",
			"text": "How do sheep say Merry Christmas? Fleece Navidad!"
		},
		{
			"id": 6,
			"category": "Christmas",
			"text": "What did one snowman say to the other? Do you smell carrots?"
		},
		{
			"id": 7,
			"category": "Christmas",
			"text": "Why was the Christmas tree so bad at knitting? It kept dropping its needles."
		},
		{
			"id": 8,
			"category": "Christmas",
			"text": "What do you call an elf who sings? A wrapper!"
		},
		{
			"id": 9,
			"category": "Christmas",
			"text": "Why did the Christmas tree get promoted? It had all the right branches covered!"
		},
		{
			"id": 10,
			"category": "Christmas",
			"text": "What do you call people who are afraid of Santa Claus? Claustrophobic!"
		},
		{
			"id": 11,
			"category": "Christmas",
			"text": "Why was the Christmas ornament stressed at work? It was hanging by a thread!"
		},
		{
			"id": 12,
			"category": "Christmas",
			"text": "How does a snowman get to work? By “icicle”!"
		},
		{
			"id": 13,
			"category": "Christmas",
			"text": "Why did the gingerbread man fail his job interview? He crumbled under the pressure."
		},
		{
			"id": 14,
			"category": "Christmas",
			"text": "What do you call a workplace that runs out of coffee during Christmas? A silent night!"
		},
		{
			"id": 15,
			"category": "Christmas",
			"text": "Why did the office computer hate Christmas? It couldn’t handle the “cookies”!"
		},
		{
			"id": 16,
			"category": "Christmas",
			"text": "What do you call an elf who loves spreadsheets? Excel-ent!"
		},
		{
			"id": 17,
			"category": "Christmas",
			"text": "Why did Santa refuse to work in HR? He didn’t want to deal with “naughty” lists!"
		},
		{
			"id": 18,
			"category": "Christmas",
			"text": "How do snowmen send their Christmas cards? By “ice-mail”!"
		},
		{
			"id": 19,
			"category": "Christmas",
			"text": "Why did the Christmas lights file a complaint? They felt they were being kept in the dark!"
		},
		{
			"id": 20,
			"category": "Christmas",
			"text": "Why does Santa’s team always meet deadlines? They have great “elf-discipline”!"
		},
		{
			"id": 21,
			"category": "Engineering",
			"text": "Why did Santa hire an engineer? To optimize his sleigh’s gift-to-weight ratio!"
		},
		{
			"id": 22,
			"category": "Engineering",
			"text": "What do engineers call Santa’s workshop? A high-efficiency production line!"
		},
		{
			"id": 23,
			"category": "Engineering",
			"text": "Why was the Christmas light display so impressive? It was a bright idea with flawless execution!"
		},
		{
			"id": 24,
			"category": "Engineering",
			"text": "How do engineers build snowmen? With precise calculations and optimal load distribution!"
		},
		{
			"id": 25,
			"category": "Engineering",
			"text": "What do you call an electrical engineer at Christmas? A circuit-elf!"
		},
		{
			"id": 26,
			"category": "Engineering",
			"text": "Why did the bridge engineer miss the Christmas party? They were tied up with some tension!"
		},
		{
			"id": 27,
			"category": "Engineering",
			"text": "Why did the engineer redesign Santa’s sleigh? To improve its aerodynamic coefficient!"
		},
		{
			"id": 28,
			"category": "Engineering",
			"text": "Why don’t engineers decorate with tinsel? It causes too much resistance!"
		},
		{
			"id": 29,
			"category": "Engineering",
			"text": "How do engineers wrap Christmas presents? With perfect geometric folds and minimal tape usage!"
		},
		{
			"id": 30,
			"category": "Engineering",
			"text": "Why did the civil engineer bring concrete to Christmas dinner? They wanted to lay a solid foundation for the holiday season!"
		},
		{
			"id": 31,
			"category": "Engineering",
			"text": "What’s Santa’s favorite engineering discipline? Reindeer dynamics!"
		},
		{
			"id": 32,
			"category": "Engineering",
			"text": "Why was the electrical engineer’s Christmas tree so special? It had a parallel circuit of lights to avoid burnout!"
		},
		{
			"id": 33,
			"category": "Engineering",
			"text": "What’s an engineer’s favorite Christmas drink? Ohm-made eggnog!"
		},
		{
			"id": 34,
			"category": "Engineering",
			"text": "Why do engineers love the holiday season? It’s the only time they can take a load off without compromising safety factors!"
		},
		{
			"id": 35,
			"category": "Engineering",
			"text": "What’s an engineer’s least favorite part of Christmas? Wrapping gifts without a blueprint!"
		},
		{
			"id": 36,
			"category": "Dad",
			"text": "What did Frosty’s girlfriend give him when she was mad at him? The cold shoulder."
		},
		{
			"id": 37,
			"category": "Dad",
			"text": "What do snowmen eat for breakfast? Ice crispies."
		},
		{
			"id": 38,
			"category": "Dad",
			"text": "What does Santa suffer from if he gets stuck in a chimney? Claus-trophobia!."
		},
		{
			"id": 39,
			"category": "Dad",
			"text": "How do you know when Santa’s around? You can always sense his presents."
		},
		{
			"id": 40,
			"category": "Dad",
			"text": "What does Santa suffer from if he gets stuck in a chimney? Claus-trophobia!."
		},
		{
			"id": 41,
			"category": "Dad",
			"text": "What was Santa's favorite subject in school? Chemis-tree!"
		},
		{
			"id": 42,
			"category": "Dad",
			"text": "What do Santa’s little helpers learn at school? The elf-abet."
		},
		{
			"id": 43,
			"category": "Dad",
			"text": "How much did Santa pay for his sleigh? Nothing — it was on the house!"
		},
		{
			"id": 44,
			"category": "Dad",
			"text": "What do snowmen call their offspring? Chill-dren"
		},
		{
			"id": 45,
			"category": "Dad",
			"text": "What did the beaver say to the Christmas Tree? Nice gnawing you"
		},
		{
			"id": 46,
			"category": "Dad",
			"text": "Who delivers Christmas presents to sharks? Santa Jaws."
		},
		{
			"id": 47,
			"category": "Dad",
			"text": "What kind of motorbike does Santa ride? A Holly Davidson!"
		},
		{
			"id": 48,
			"category":"Dad",
			"text":"What do reindeer hang on their Christmas trees? Hornaments."
		},
		{
			"id": 49,
			"category":"Dad",
			"text":"What is the best Christmas present? A broken drum, you just can’t beat it."
		}
	]
